In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\windows10\Desktop\Hands_on_Machine_Learniing\code_basics\ML\14_naive_bayes\titanic.csv")

In [3]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
#Dropping Some Columns
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
# Creating dummie variables for the "Sex" column
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
# Instade of creating the summie variables we can just simple use df.Sex = df.Sex.map({'male': 1, 'female': 2})

In [7]:
df = pd.concat([df, dummies], axis = 1)
df.head(2)

   Pclass     Sex   Age     Fare  Survived  female  male
0       3    male  22.0   7.2500         0       0     1
1       1  female  38.0  71.2833         1       1     0

In [8]:
# Now we can drop the sex and male/female class because from ome class we can get all the information
df.drop(['Sex', 'male'], axis = 1, inplace = True)
df.head(2)

   Pclass   Age     Fare  Survived  female
0       3  22.0   7.2500         0       0
1       1  38.0  71.2833         1       1

In [9]:
# Lets check in which column we have null value or every column is pure.
df.columns[df.isna().any()]

Index(['Age'], dtype='object')

In [10]:
df.Age = df.Age.fillna(df.Age.mean())
df.isna().sum()

Pclass      0
Age         0
Fare        0
Survived    0
female      0
dtype: int64

In [11]:
X = df.drop('Survived', axis = 1)
y = df.Survived

In [12]:
print(len(X))
len(y)

891

891

In [13]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [14]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [15]:
model.fit(X_train, y_train);

In [16]:
model.score(X_test, y_test)

0.776536312849162

In [17]:
model.predict_proba(X_test[:10])

array([[0.96384665, 0.03615335],
       [0.73540569, 0.26459431],
       [0.96148895, 0.03851105],
       [0.93143311, 0.06856689],
       [0.92960245, 0.07039755],
       [0.96730703, 0.03269297],
       [0.93398966, 0.06601034],
       [0.92893433, 0.07106567],
       [0.43544798, 0.56455202],
       [0.40811105, 0.59188895]])

**Calculate the score using cross validation**

In [18]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.76223776, 0.76223776, 0.80985915, 0.8028169 , 0.74647887])